In [66]:
import pandas as pd

In [2]:
print(pd.__version__)

2.2.2

In [15]:
dataframe = pd.read_csv('../doit_pandas-master/data/gapminder.tsv', sep='\t')

In [16]:
dataframe.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [17]:
print(dataframe.head())

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [18]:
gisa_df = pd.read_csv('.\data\Abc1115.csv')

In [19]:
gisa_df.head()

   990001  addx   17   29   16   49   43  154  C  A C.1
0  990002  stch   30    9   48   25   81  193  C  A   A
1  990003  gali   93   60    6   84   36  279  A  C   A
2  990004  miat   73   22   48   24   72  239  B  C   C
3  990005  oran   33   38   59   58   28  216  C  B   A
4  990006  sj24   27   65   54   77   33  256  B  A   A

In [20]:
print(gisa_df.head())

   990001  addx   17   29   16   49   43  154  C  A C.1
0  990002  stch   30    9   48   25   81  193  C  A   A
1  990003  gali   93   60    6   84   36  279  A  C   A
2  990004  miat   73   22   48   24   72  239  B  C   C
3  990005  oran   33   38   59   58   28  216  C  B   A
4  990006  sj24   27   65   54   77   33  256  B  A   A

In [21]:
type(gisa_df)

pandas.core.frame.DataFrame

In [22]:
dataframe.tail(12)

       country continent  year  lifeExp       pop   gdpPercap
1692  Zimbabwe    Africa  1952   48.451   3080907  406.884115
1693  Zimbabwe    Africa  1957   50.469   3646340  518.764268
1694  Zimbabwe    Africa  1962   52.358   4277736  527.272182
1695  Zimbabwe    Africa  1967   53.995   4995432  569.795071
1696  Zimbabwe    Africa  1972   55.635   5861135  799.362176
1697  Zimbabwe    Africa  1977   57.674   6642107  685.587682
1698  Zimbabwe    Africa  1982   60.363   7636524  788.855041
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [23]:
dataframe.shape

(1704, 6)

In [27]:
dataframe.info

<bound method DataFrame.info of           country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]>

In [24]:
dataframe.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [29]:
df_country = dataframe['country']

In [30]:
type(df_country)

pandas.core.series.Series

In [26]:
tlist = [
    [1, 2],
    [3, 4]
]

In [28]:
print(tlist[0][1])
print(tlist[1][1])

2
4

In [35]:
dataframe[['country', 'year']]

          country  year
0     Afghanistan  1952
1     Afghanistan  1957
2     Afghanistan  1962
3     Afghanistan  1967
4     Afghanistan  1972
...           ...   ...
1699     Zimbabwe  1987
1700     Zimbabwe  1992
1701     Zimbabwe  1997
1702     Zimbabwe  2002
1703     Zimbabwe  2007

[1704 rows x 2 columns]

In [36]:
df_two = dataframe[['country', 'year']]

In [37]:
type(df_two)

pandas.core.frame.DataFrame

In [38]:
df = pd.read_csv('../doit_pandas-master/data/gapminder.tsv', sep='\t')

In [41]:
df_test = pd.read_csv('./data/Abc1115.csv')

In [42]:
df_test.head()

   990001  addx   17   29   16   49   43  154  C  A C.1
0  990002  stch   30    9   48   25   81  193  C  A   A
1  990003  gali   93   60    6   84   36  279  A  C   A
2  990004  miat   73   22   48   24   72  239  B  C   C
3  990005  oran   33   38   59   58   28  216  C  B   A
4  990006  sj24   27   65   54   77   33  256  B  A   A

In [39]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [43]:
df[['country', 'year']]

          country  year
0     Afghanistan  1952
1     Afghanistan  1957
2     Afghanistan  1962
3     Afghanistan  1967
4     Afghanistan  1972
...           ...   ...
1699     Zimbabwe  1987
1700     Zimbabwe  1992
1701     Zimbabwe  1997
1702     Zimbabwe  2002
1703     Zimbabwe  2007

[1704 rows x 2 columns]

In [44]:
df.shape

(1704, 6)

In [45]:
df.loc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

In [49]:
print(df.loc[0, 'country'])
print(df.loc[1, 'country'])

Afghanistan
Afghanistan

In [50]:
print(df.loc[0][0])
print(df.loc[1][0])

Afghanistan
Afghanistan

C:\Users\201\AppData\Local\Temp\ipykernel_11376\47256502.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.loc[0][0])
C:\Users\201\AppData\Local\Temp\ipykernel_11376\47256502.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.loc[1][0])

In [62]:
df.head(1)

       country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314

In [60]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [53]:
df['country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [55]:
print(df.loc[0:5]['country'])
# print(df.loc[-1]['country'])

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
5    Afghanistan
Name: country, dtype: object

In [58]:
print(df.iloc[:,0])
# print(df.iloc[1][0])

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [64]:
# df의 첫 번째 10번째 100번째 정보를 출력하시오
df.iloc[[0,9,99], [0,3,4]]

        country  lifeExp       pop
0   Afghanistan   28.801   8425333
9   Afghanistan   41.763  22227415
99   Bangladesh   43.453  62821884

In [ ]:
# df의 첫 번째 10번째 100번째 정보를 country, lifeExp, pop를 출력하시오
df.iloc[[0,9,99], ['country', 'lifeExp', 'pop']]

In [65]:
# df의 연속적으로 첫 번째에서 10번째 정보를 country, lifeExp, pop를 출력하시오
df.iloc[:10,[0,3,4]]

       country  lifeExp       pop
0  Afghanistan   28.801   8425333
1  Afghanistan   30.332   9240934
2  Afghanistan   31.997  10267083
3  Afghanistan   34.020  11537966
4  Afghanistan   36.088  13079460
5  Afghanistan   38.438  14880372
6  Afghanistan   39.854  12881816
7  Afghanistan   40.822  13867957
8  Afghanistan   41.674  16317921
9  Afghanistan   41.763  22227415

In [82]:
df = pd.read_csv('../doit_pandas-master/data/gapminder.tsv', sep='\t')

In [68]:
# C(생성, 추가)RUD
s = pd.Series(['banana', 42])

In [69]:
print(s)

0    banana
1        42
dtype: object

In [72]:
s1 = pd.Series(['Wes Mckinney', 'Createor of Pandas'], index = ['Person', 'Who'])

In [73]:
print(s1)

Person          Wes Mckinney
Who       Createor of Pandas
dtype: object

In [75]:
df = pd.DataFrame(
    data = {'Occupation':['Chemist', 'Statistician'],
           'Born' : ['1920-07-25', '1876-06-13'],
           'Age' : [27, 61]},
    index = ['Rosaline Franklin', 'William Gosset'],
    columns = ['Occupation', 'Born', 'Age']
)

In [77]:
print(df)

                     Occupation        Born  Age
Rosaline Franklin       Chemist  1920-07-25   27
William Gosset     Statistician  1876-06-13   61

In [80]:
df.loc['Rosaline Franklin', :]

Occupation       Chemist
Born          1920-07-25
Age                   27
Name: Rosaline Franklin, dtype: object

In [81]:
df.loc[:,'Age']

Rosaline Franklin    27
William Gosset       61
Name: Age, dtype: int64

In [84]:
ages = df.loc

KeyError: 'Age'

In [85]:
print(ages.max())

NameError: name 'ages' is not defined

In [ ]:
print(ages.std())

In [91]:
gisa = pd.read_csv('./data/Abc1115.csv',header=None)

In [92]:
gisa.describe()

,0,2,3,4,5,6,7
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,990500.500000,50.026000,49.543000,50.920000,51.275000,50.915000,252.679000
std,288.819436,28.498904,29.046684,29.288178,28.770664,28.434456,65.199179
min,990001.000000,1.000000,1.000000,1.000000,1.000000,1.000000,67.000000
25%,990250.750000,26.000000,25.000000,25.000000,26.000000,25.000000,207.000000
50%,990500.500000,48.000000,49.000000,50.000000,52.000000,52.000000,251.000000
75%,990750.250000,75.000000,74.000000,76.000000,76.000000,75.000000,298.000000
max,991000.000000,100.000000,100.000000,100.000000,100.000000,100.000000,434.000000

In [93]:
scientists = pd.read_csv('../doit_pandas-master/data/scientists.csv')

In [94]:
ages = scientists['Age']

In [97]:
print(ages[ages>ages.mean()])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [98]:
ages>ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [99]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64